-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 18, 2023 at 06:23 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `accounting_web`
--

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ghi_sos`
--

CREATE TABLE `chung_tu_ghi_sos` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `HoTen` varchar(255) NOT NULL,
  `MaKhachHangNo` varchar(255) DEFAULT NULL,
  `TenKhachHangNo` varchar(255) DEFAULT NULL,
  `MaSoThueNo` varchar(255) DEFAULT NULL,
  `MaKhachHangCo` varchar(255) DEFAULT NULL,
  `TenKhachHangCo` varchar(255) DEFAULT NULL,
  `MaSoThueCo` varchar(255) DEFAULT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `BieuThue` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `ThueGTGT` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ghi_so_chi_tiets`
--

CREATE TABLE `chung_tu_ghi_so_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `DienGiaiChiTiet` varchar(255) NOT NULL,
  `SoTien` double NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ket_chuyens`
--

CREATE TABLE `chung_tu_ket_chuyens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ket_chuyen_chi_tiets`
--

CREATE TABLE `chung_tu_ket_chuyen_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `DienGiaiChiTiet` varchar(255) NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `SoTien` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ngan_hangs`
--

CREATE TABLE `chung_tu_ngan_hangs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `HoTen` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `ThuChi` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `chung_tu_ngan_hangs`
--

INSERT INTO `chung_tu_ngan_hangs` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `HoTen`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `DienGiai`, `ThuChi`, `created_at`, `updated_at`) VALUES
(1, 'TG-01', 'TG', '2023-12-18', '01', 'Demo', 'KH01', 'Đỗ Ngọc Quang', '123456', 'Demo', 1, '2023-12-17 21:51:28', '2023-12-17 21:51:28');

-- --------------------------------------------------------

--
-- Table structure for table `chung_tu_ngan_hang_chi_tiets`
--

CREATE TABLE `chung_tu_ngan_hang_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `DienGiaiChiTiet` varchar(255) NOT NULL,
  `SoTien` double NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `chung_tu_ngan_hang_chi_tiets`
--

INSERT INTO `chung_tu_ngan_hang_chi_tiets` (`id`, `MaChungTu`, `DienGiaiChiTiet`, `SoTien`, `TaiKhoanNo`, `TaiKhoanCo`, `created_at`, `updated_at`) VALUES
(1, 'TG-01', 'Demo', 1, '1121', '131', '2023-12-17 21:51:28', '2023-12-17 21:51:28');

-- --------------------------------------------------------

--
-- Table structure for table `danh_muc_chung_tus`
--

CREATE TABLE `danh_muc_chung_tus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaLoaiChungTu` varchar(255) NOT NULL,
  `TenLoaiChungTu` varchar(255) NOT NULL,
  `TenBang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `danh_muc_hang_hoas`
--

CREATE TABLE `danh_muc_hang_hoas` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaHang` varchar(255) NOT NULL,
  `TenHang` varchar(255) NOT NULL,
  `NhomHang` varchar(255) NOT NULL,
  `DonViTinh` varchar(255) NOT NULL,
  `SoLuongTonDau` double NOT NULL,
  `ThanhTienTonDau` double NOT NULL,
  `NgayTonDau` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `danh_muc_hang_hoas`
--

INSERT INTO `danh_muc_hang_hoas` (`id`, `MaHang`, `TenHang`, `NhomHang`, `DonViTinh`, `SoLuongTonDau`, `ThanhTienTonDau`, `NgayTonDau`, `created_at`, `updated_at`) VALUES
(1, 'HH1', 'Hàng hóa thử nghiệm', 'HH', 'Bản', 10, 1000, '2023-12-18', '2023-12-17 21:26:56', '2023-12-17 21:41:35'),
(2, 'HH2', 'Máy tính xách tay Laptop', 'HH', 'Chiếc', 9, 900, '2023-12-18', '2023-12-17 21:34:19', '2023-12-17 21:50:28');

-- --------------------------------------------------------

--
-- Table structure for table `danh_muc_khach_hangs`
--

CREATE TABLE `danh_muc_khach_hangs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `DiaChi` varchar(255) NOT NULL,
  `TinhThanhPho` varchar(255) NOT NULL,
  `DienThoai` varchar(255) NOT NULL,
  `Fax` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `danh_muc_khach_hangs`
--

INSERT INTO `danh_muc_khach_hangs` (`id`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `DiaChi`, `TinhThanhPho`, `DienThoai`, `Fax`, `created_at`, `updated_at`) VALUES
(1, 'KH01', 'Đỗ Ngọc Quang', '123456', 'Quận 10', 'HCM', '0393939393', NULL, '2023-12-17 21:25:56', '2023-12-17 21:25:56');

-- --------------------------------------------------------

--
-- Table structure for table `danh_muc_tai_khoans`
--

CREATE TABLE `danh_muc_tai_khoans` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `TaiKhoan` varchar(255) NOT NULL,
  `TenTaiKhoan` varchar(255) NOT NULL,
  `SoDuNoDau` double NOT NULL,
  `SoDuCoDau` double NOT NULL,
  `CoDinhKhoan` tinyint(1) NOT NULL,
  `Cap` varchar(255) NOT NULL,
  `NgaySoDu` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `danh_muc_tai_khoans`
--

INSERT INTO `danh_muc_tai_khoans` (`id`, `TaiKhoan`, `TenTaiKhoan`, `SoDuNoDau`, `SoDuCoDau`, `CoDinhKhoan`, `Cap`, `NgaySoDu`, `created_at`, `updated_at`) VALUES
(1, '111', 'Tiền mặt', 100, 100, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:30:50'),
(2, '1111', 'Tiền Việt Nam', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(3, '1112', 'Ngoại tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(4, '1113', 'Vàng tiền tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(5, '112', 'Tiền gửi Ngân hàng', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(6, '1121', 'Tiền Việt Nam', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(7, '1122', 'Ngoại tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(8, '1123', 'Vàng tiền tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(9, '113', 'Tiền đang chuyển', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(10, '1131', 'Tiền Việt Nam', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(11, '1132', 'Ngoại tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(12, '121', 'Chứng khoán kinh doanh', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(13, '1211', 'Cổ phiếu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(14, '1212', 'Trái phiếu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(15, '1218', 'Chứng khoán và các công cụ tài chính khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(16, '128', 'Đầu tư nắm giữ đến ngày đáo hạn', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(17, '1281', 'Tiền gửi có kỳ hạn', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(18, '1282', 'Trái phiếu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(19, '1283', 'Cho vay', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(20, '1288', 'Các khoản đầu tư khác nắm giữ đến ngày đáo hạn', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(21, '131', 'Phải thu của khách hàng', 1500, 100, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:50:28'),
(22, '133', 'Thuế GTGT được khấu trừ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(23, '1331', 'Thuế GTGT được khấu trừ của hàng hóa, dịch vụ', 200, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:46:22'),
(24, '1332', 'Thuế GTGT được khấu trừ của Tài sản cố định', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(25, '136', 'Phải thu nội bộ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(26, '1361', 'Vốn kinh doanh ở các đơn vị trực thuộc', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(27, '1362', 'Phải thu nội bộ về chênh lệch tỷ giá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(28, '1363', 'Phải thu nội bộ về chi phí đi vay đủ điều kiện được vốn hoá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(29, '1368', 'Phải thu nội bộ khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(30, '138', 'Phải thu khác', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(31, '1381', 'Tài sản thiếu chờ xử lý', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(32, '1385', 'Phải thu về cổ phần hoá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(33, '1388', 'Phải thu khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(34, '141', 'Tạm ứng', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(35, '151', 'Hàng mua đang đi đường', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(36, '152', 'Nguyên liệu, vật liệu', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(37, '153', 'Công cụ, dụng cụ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(38, '1531', 'Công cụ, dụng cụ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(39, '1532', 'Bao bì luân chuyển', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(40, '1533', 'Đồ dùng cho thuê', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(41, '1534', 'Thiết bị, phụ tùng thay thế', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(42, '154', 'Chi phí sản xuất, kinh doanh dở dang', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(43, '1541', 'Xây lắp', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(44, '1542', 'Sản phẩm khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(45, '1543', 'Dịch vụ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(46, '1544', 'Chi phí bảo hành xây lắp', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(47, '155', 'Thành phẩm', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(48, '1551', 'Thành phẩm nhập kho', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(49, '1557', 'Thành phẩm bất động sản', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(50, '156', 'Hàng hóa', 2000, 100, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:50:28'),
(51, '1561', 'Giá mua hàng hóa', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(52, '1562', 'Chi phí thu mua hàng hóa', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(53, '1567', 'Hàng hóa bất động sản', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(54, '157', 'Hàng gửi đi bán', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(55, '158', 'Hàng hoá kho bảo thuế', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(56, '161', 'Chi sự nghiệp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(57, '1611', 'Chi sự nghiệp năm trước', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(58, '1612', 'Chi sự nghiệp năm nay', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(59, '171', 'Giao dịch mua, bán lại trái phiếu Chính phủ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(60, '211', 'Tài sản cố định hữu hình', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(61, '2111', 'Nhà cửa, vật kiến trúc', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(62, '2112', 'Máy móc, thiết bị', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(63, '2113', 'Phương tiện vận tải, truyền dẫn', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(64, '2114', 'Thiết bị, dụng cụ quản lý', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(65, '2115', 'Cây lâu năm, súc vật làm việc và cho sản phẩm', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(66, '2118', 'Tài sản cố định khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(67, '212', 'Tài sản cố định thuê tài chính', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(68, '2121', 'TSCĐ hữu hình thuê tài chính', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(69, '2122', 'TSCĐ vô hình thuê tài chính', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(70, '213', 'Tài sản cố định vô hình', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(71, '2131', 'Quyền sử dụng đất', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(72, '2132', 'Quyền phát hành', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(73, '2133', 'Bản quyền, bằng sáng chế', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(74, '2134', 'Nhãn hiệu, tên thương mại', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(75, '2135', 'Chương trình phần mềm', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(76, '2136', 'Giấy phép và giấy phép nhượng quyền ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(77, '2138', 'TSCĐ vô hình khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(78, '214', 'Hao mòn tài sản cố định', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(79, '2141', 'Hao mòn TSCĐ hữu hình', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(80, '2142', 'Hao mòn TSCĐ thuê tài chính', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(81, '2143', 'Hao mòn TSCĐ vô hình', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(82, '2147', 'Hao mòn bất động sản đầu tư', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(83, '217', 'Bất động sản đầu tư', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(84, '221', 'Đầu tư vào công ty con', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(85, '222', 'Đầu tư vào công ty liên doanh, liên kết', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(86, '228', 'Đầu tư khác', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(87, '2281', 'Đầu tư góp vốn vào đơn vị khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(88, '2288', 'Đầu tư khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(89, '229', 'Dự phòng tổn thất tài sản', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(90, '2291', 'Dự phòng giảm giá chứng khoán kinh doanh', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(91, '2292', 'Dự phòng tổn thất đầu tư vào đơn vị khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(92, '2293', 'Dự phòng phải thu khó đòi', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:15', '2023-12-17 21:23:15'),
(93, '2294', 'Dự phòng giảm giá hàng tồn kho', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(94, '241', 'Xây dựng cơ bản dở dang', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(95, '2411', 'Mua sắm TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(96, '2412', 'Xây dựng cơ bản', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(97, '2413', 'Sửa chữa lớn TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(98, '242', 'Chi phí trả trước', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(99, '243', 'Tài sản thuế thu nhập hoãn lại', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(100, '244', 'Cầm cố, thế chấp, ký quỹ, ký cược', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(101, '331', 'Phải trả cho người bán', 0, 2000, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:46:22'),
(102, '333', 'Thuế và các khoản phải nộp Nhà nước', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(103, '3331', 'Thuế giá trị gia tăng phải nộp', 0, 150, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:50:28'),
(104, '33311', 'Thuế GTGT đầu ra', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(105, '33312', 'Thuế GTGT hàng nhập khẩu', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(106, '3332', 'Thuế tiêu thụ đặc biệt', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(107, '3333', 'Thuế xuất, nhập khẩu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(108, '3334', 'Thuế thu nhập doanh nghiệp', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(109, '3335', 'Thuế thu nhập cá nhân', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(110, '3336', 'Thuế tài nguyên', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(111, '3337', 'Thuế nhà đất, tiền thuê đất', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(112, '3338', 'Thuế bảo vệ môi trường và các loại thuế khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(113, '33381', 'Thuế bảo vệ môi trường', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(114, '33382', 'Các loại thuế khác', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(115, '3339', 'Phí, lệ phí và các khoản phải nộp khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(116, '334', 'Phải trả người lao động', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(117, '3341', 'Phải trả công nhân viên', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(118, '3348', 'Phải trả người lao động khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(119, '335', 'Chi phí phải trả', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(120, '336', 'Phải trả nội bộ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(121, '3361', 'Phải trả nội bộ về vốn kinh doanh', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(122, '3362', 'Phải trả nội bộ về chênh lệch tỷ giá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(123, '3363', 'Phải trả nội bộ về chi phí đi vay đủ điều kiện được vốn hoá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(124, '3368', 'Phải trả nội bộ khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(125, '337', 'Thanh toán theo tiến độ kế hoạch hợp đồng xây dựng', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(126, '338', 'Phải trả, phải nộp khác', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(127, '3381', 'Tài sản thừa chờ giải quyết', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(128, '3382', 'Kinh phí công đoàn', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(129, '3383', 'Bảo hiểm xã hội', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(130, '3384', 'Bảo hiểm y tế', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(131, '3385', 'Phải trả về cổ phần hoá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(132, '3386', 'Bảo hiểm thất nghiệp', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(133, '3387', 'Doanh thu chưa thực hiện', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(134, '3388', 'Phải trả, phải nộp khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(135, '341', 'Vay và nợ thuê tài chính', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(136, '3411', 'Các khoản đi vay', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(137, '3412', 'Nợ thuê tài chính', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(138, '343', 'Trái phiếu phát hành', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(139, '3431', 'Trái phiếu thường', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(140, '34311', 'Mệnh giá trái phiếu', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(141, '34312', 'Chiết khấu trái phiếu', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(142, '34313', 'Mệnh giá trái phiếu', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(143, '3432', 'Trái phiếu chuyển đổi', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(144, '344', 'Nhận ký quỹ, ký cược', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(145, '347', 'Thuế thu nhập hoãn lại phải trả', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(146, '352', 'Dự phòng phải trả', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(147, '3521', 'Dự phòng bảo hành sản phẩm hàng hóa', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(148, '3522', 'Dự phòng bảo hành công trình xây dựng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(149, '3523', 'Dự phòng tái cơ cấu doanh nghiệp', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(150, '3524', 'Dự phòng phải trả khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(151, '353', 'Quỹ khen thưởng, phúc lợi', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(152, '3531', 'Quỹ khen thưởng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(153, '3532', 'Quỹ phúc lợi', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(154, '3533', 'Quỹ phúc lợi đã hình thành tài sản cố định', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(155, '3534', 'Quỹ thưởng ban quản lý điều hành công ty', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(156, '356', 'Quỹ phát triển khoa học và công nghệ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(157, '3561', 'Quỹ phát triển khoa học và công nghệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(158, '3562', 'Quỹ phát triển KH và CN đã hình thành TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(159, '357', 'Quỹ bình ổn giá', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(160, '411', 'Vốn đầu tư của chủ sở hữu', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(161, '4111', 'Vốn góp của chủ sở hữu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(162, '41111', 'Cổ phiếu phổ thông có quyền biểu quyết', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(163, '41112', 'Cổ phiếu ưu đãi', 0, 0, 0, '3', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(164, '4112', 'Thặng dư vốn cổ phần', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(165, '4113', 'Quyền chọn chuyển đổi trái phiếu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(166, '4118', 'Vốn khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(167, '412', 'Chênh lệch đánh giá lại tài sản', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(168, '413', 'Chênh lệch tỷ giá hối đoái', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(169, '4131', 'Chênh lệch tỷ do giá đánh giá lại các khoản mục tiền tệ có gốc ngoại tệ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(170, '4132', 'Chênh lệch tỷ giá hối đoái giai đoạn trước hoạt động', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(171, '414', 'Quỹ đầu tư phát triển', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(172, '417', 'Quỹ hỗ trợ sắp xếp doanh nghiệp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(173, '418', 'Các quỹ khác thuộc vốn chủ sở hữu', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(174, '419', 'Cổ phiếu quỹ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(175, '421', 'Lợi nhuận sau thuế chưa phân phố', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(176, '4211', 'Lợi nhuận sau thuế chưa phân phối năm trước', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(177, '4212', 'Lợi nhuận sau thuế chưa phân phối năm nay', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(178, '441', 'Nguồn vốn đầu tư xây dựng cơ bản', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(179, '461', 'Nguồn kinh phí sự nghiệp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(180, '4611', 'Nguồn kinh phí sự nghiệp năm trước', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(181, '4612', 'Nguồn kinh phí sự nghiệp năm nay', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(182, '466', 'Nguồn kinh phí hình thành TSCĐ', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(183, '511', 'Doanh thu bán hàng và cung cấp dịch vụ', 0, 1500, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:50:28'),
(184, '5111', 'Doanh thu bán hàng hóa', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(185, '5112', 'Doanh thu bán các thành phẩm', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(186, '5113', 'Doanh thu cung cấp dịch vụ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(187, '5114', 'Doanh thu trợ cấp, trợ giá', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(188, '5117', 'Doanh thu kinh doanh bất động sản đầu tư', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(189, '5118', 'Doanh thu khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(190, '515', 'Doanh thu hoạt động tài chính', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(191, '521', 'Các khoản giảm trừ doanh thu', 0, 0, 0, '', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(192, '5211', 'Chiết khấu thương mại', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(193, '5212', 'Hàng bán bị trả lại', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(194, '5213', 'Giảm giá hàng bán', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(195, '611', 'Mua hàng', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(196, '6111', 'Mua nguyên liệu, vật liệu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(197, '6112', 'Mua hàng hóa', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(198, '621', 'Chi phí nguyên liệu, vật liệu trực tiếp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(199, '622', 'Chi phí nhân công trực tiếp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(200, '623', 'Chi phí sử dụng máy thi công', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(201, '6231', 'Chi phí nhân công', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(202, '6232', 'Chi phí vật liệu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(203, '6233', 'Chi phí dụng cụ sản xuất', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(204, '6234', 'Chi phí khấu hao máy thi công', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(205, '6237', 'Chi phí dịch vụ mua ngoài', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(206, '6238', 'Chi phí bằng tiền khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(207, '627', 'Chi phí sản xuất chung', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(208, '6271', 'Chi phí nhân viên phân xưởng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(209, '6272', 'Chi phí vật liệu', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(210, '6273', 'Chi phí dụng cụ sản xuất', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(211, '6274', 'Chi phí khấu hao TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(212, '6277', 'Chi phí dịch vụ mua ngoài', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(213, '6278', 'Chi phí bằng tiền khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(214, '631', 'Giá thành sản xuất', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(215, '632', 'Giá vốn hàng bán', 200, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:50:28'),
(216, '635', 'Chi phí tài chính', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(217, '641', 'Chi phí bán hàng', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(218, '6411', 'Chi phí nhân viên', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(219, '6412', 'Chi phí vật liệu, bao bì', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(220, '6413', 'Chi phí dụng cụ, đồ dùng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(221, '6414', 'Chi phí khấu hao TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(222, '6415', 'Chi phí bảo hành', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(223, '6417', 'Chi phí dịch vụ mua ngoài', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(224, '6418', 'Chi phí bằng tiền khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(225, '642', 'Chi phí quản lý doanh nghiệp  ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(226, '6421', 'Chi phí nhân viên quản lý', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(227, '6422', 'Chi phí vật liệu quản lý', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(228, '6423', 'Chi phí đồ dùng văn phòng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(229, '6424', 'Chi phí khấu hao TSCĐ', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(230, '6425', 'Thuế, phí và lệ phí', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(231, '6426', 'Chi phí dự phòng', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(232, '6427', 'Chi phí dịch vụ mua ngoài', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(233, '6428', 'Chi phí bằng tiền khác', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(234, '711', 'Thu nhập khác', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(235, '811', 'Chi phí khác', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(236, '821', 'Chi phí thuế thu nhập doanh nghiệp', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(237, '8211', 'Chi phí thuế TNDN hiện hành', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(238, '8212', 'Chi phí thuế TNDN hoãn lại', 0, 0, 0, '2', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16'),
(239, '911', 'Xác định kết quả kinh doanh', 0, 0, 0, '1', '2023-12-18', '2023-12-17 21:23:16', '2023-12-17 21:23:16');

-- --------------------------------------------------------

--
-- Table structure for table `danh_muc_tai_khoan_cong_no_khach_hangs`
--

CREATE TABLE `danh_muc_tai_khoan_cong_no_khach_hangs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `TaiKhoan` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `SoDuNoDau` double NOT NULL,
  `SoDuCoDau` double NOT NULL,
  `NgaySoDu` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2023_09_26_075014_create_danh_muc_khach_hang_table', 1),
(6, '2023_09_26_075044_create_danh_muc_tai_khoan_table', 1),
(7, '2023_09_26_075102_create_danh_muc_tai_khoan_cong_no_khach_hang_table', 1),
(8, '2023_09_26_075132_create_danh_muc_hang_hoa_table', 1),
(9, '2023_09_26_075148_create_thong_tin_cong_ty_table', 1),
(10, '2023_09_26_075205_create_danh_muc_chung_tu_table', 1),
(11, '2023_09_26_075412_create_phieu_thu_table', 1),
(12, '2023_09_26_075437_create_phieu_thu_chi_tiet_table', 1),
(13, '2023_09_26_075454_create_phieu_chi_table', 1),
(14, '2023_09_26_075512_create_phieu_chi_chi_tiet_table', 1),
(15, '2023_09_26_075524_create_chung_tu_ngan_hang_table', 1),
(16, '2023_09_26_075540_create_chung_tu_ngan_hang_chi_tiet_table', 1),
(17, '2023_09_26_075558_create_phieu_nhap_hang_hoa_table', 1),
(18, '2023_09_26_075611_create_phieu_nhap_hang_hoa_chi_tiet_table', 1),
(19, '2023_09_26_075623_create_phieu_xuat_hang_hoa_table', 1),
(20, '2023_09_26_075634_create_phieu_xuat_hang_hoa_chi_tiet_table', 1),
(21, '2023_09_26_075646_create_phieu_nhap_hang_tra_lai_table', 1),
(22, '2023_09_26_075658_create_phieu_nhap_hang_tra_lai_chi_tiet_table', 1),
(23, '2023_09_26_075713_create_phieu_xuat_hang_tra_lai_table', 1),
(24, '2023_09_26_075725_create_phieu_xuat_hang_tra_lai_chi_tiet_table', 1),
(25, '2023_09_26_075737_create_chung_tu_ghi_so_table', 1),
(26, '2023_09_26_075804_create_chung_tu_ghi_so_chi_tiet_table', 1),
(27, '2023_09_26_075820_create_chung_tu_ket_chuyen_table', 1),
(28, '2023_09_26_075832_create_chung_tu_ket_chuyen_chi_tiet_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `phieu_chis`
--

CREATE TABLE `phieu_chis` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `HoTen` varchar(255) NOT NULL,
  `DiaChi` varchar(255) NOT NULL,
  `SoChungTuGoc` double NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `BieuThue` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_chis`
--

INSERT INTO `phieu_chis` (`id`, `MaChungTu`, `LoaiChungTu`, `SoChungTu`, `NgayChungTu`, `HoTen`, `DiaChi`, `SoChungTuGoc`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `DienGiai`, `BieuThue`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `ThueSuat`, `MatHang`, `created_at`, `updated_at`) VALUES
(1, 'PC-01', 'PC', '01', '2023-12-18', 'Demo', 'Demo', 123456789, 'KH01', 'Đỗ Ngọc Quang', '123456', 'Demo', '123456789', '123456789', '123456789', '2023-12-18', 10, '123456789', '2023-12-17 21:30:50', '2023-12-17 21:30:50');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_chi_chi_tiets`
--

CREATE TABLE `phieu_chi_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `DienGiaiChiTiet` varchar(255) NOT NULL,
  `SoTien` double NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_chi_chi_tiets`
--

INSERT INTO `phieu_chi_chi_tiets` (`id`, `MaChungTu`, `DienGiaiChiTiet`, `SoTien`, `TaiKhoanNo`, `TaiKhoanCo`, `created_at`, `updated_at`) VALUES
(1, 'PC-01', '123456789', 100, '632', '111', '2023-12-17 21:30:50', '2023-12-17 21:30:50');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_nhap_hang_hoas`
--

CREATE TABLE `phieu_nhap_hang_hoas` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanNoGTGT` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `ThueGTGT` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_nhap_hang_hoas`
--

INSERT INTO `phieu_nhap_hang_hoas` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `TaiKhoanNo`, `TaiKhoanNoGTGT`, `TaiKhoanCo`, `DienGiai`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `ThueSuat`, `ThueGTGT`, `MatHang`, `created_at`, `updated_at`) VALUES
(1, 'NH-01', 'NH', '2023-12-18', '01', 'KH01', 'Đỗ Ngọc Quang', '123456', '156', '1331', '331', 'Nhập hàng hóa thử nghiệm', '123456789', '123456789', '2023-12-18', 10, 100, 'Hàng hóa thử nghiệm', '2023-12-17 21:41:35', '2023-12-17 21:41:35'),
(2, 'NH-02', 'NH', '2023-12-18', '02', 'KH01', 'Đỗ Ngọc Quang', '123456', '156', '1331', '331', 'Demo', '123', '123', '2023-12-18', 10, 100, 'Laptop', '2023-12-17 21:46:22', '2023-12-17 21:46:22');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_nhap_hang_hoa_chi_tiets`
--

CREATE TABLE `phieu_nhap_hang_hoa_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `MaHang` varchar(255) NOT NULL,
  `DonViTinh` varchar(255) NOT NULL,
  `SoLuong` double NOT NULL,
  `DonGia` double NOT NULL,
  `ThanhTien` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_nhap_hang_hoa_chi_tiets`
--

INSERT INTO `phieu_nhap_hang_hoa_chi_tiets` (`id`, `MaChungTu`, `MaHang`, `DonViTinh`, `SoLuong`, `DonGia`, `ThanhTien`, `created_at`, `updated_at`) VALUES
(1, 'NH-01', 'HH1', 'Bản', 10, 100, 1000, '2023-12-17 21:41:35', '2023-12-17 21:41:35'),
(2, 'NH-02', 'HH2', 'Chiếc', 10, 100, 1000, '2023-12-17 21:46:22', '2023-12-17 21:46:22');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_nhap_hang_tra_lais`
--

CREATE TABLE `phieu_nhap_hang_tra_lais` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `TaiKhoanNoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanCoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanNoGiaBan` varchar(255) NOT NULL,
  `TaiKhoanNoGTGT` varchar(255) NOT NULL,
  `TaiKhoanCoGiaBan` varchar(255) NOT NULL,
  `BieuThue` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `ThueGTGT` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_nhap_hang_tra_lais`
--

INSERT INTO `phieu_nhap_hang_tra_lais` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `DienGiai`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `TaiKhoanNoGiaVon`, `TaiKhoanCoGiaVon`, `TaiKhoanNoGiaBan`, `TaiKhoanNoGTGT`, `TaiKhoanCoGiaBan`, `BieuThue`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `ThueSuat`, `ThueGTGT`, `MatHang`, `created_at`, `updated_at`) VALUES
(1, 'NT-01', 'NT', '2023-12-18', '01', 'Demo', 'KH01', 'Đỗ Ngọc Quang', '123456', '632', '156', '131', '3331', '511', '123', '123', '123', '2023-12-18', 10, 15, 'Demo', '2023-12-17 22:21:07', '2023-12-17 22:21:07');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_nhap_hang_tra_lai_chi_tiets`
--

CREATE TABLE `phieu_nhap_hang_tra_lai_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `MaHang` varchar(255) NOT NULL,
  `DonViTinh` varchar(255) NOT NULL,
  `SoLuong` double NOT NULL,
  `DonGiaVon` double NOT NULL,
  `ThanhTienGiaVon` double NOT NULL,
  `DonGiaBan` double NOT NULL,
  `ThanhTienGiaBan` double NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_nhap_hang_tra_lai_chi_tiets`
--

INSERT INTO `phieu_nhap_hang_tra_lai_chi_tiets` (`id`, `MaChungTu`, `MaHang`, `DonViTinh`, `SoLuong`, `DonGiaVon`, `ThanhTienGiaVon`, `DonGiaBan`, `ThanhTienGiaBan`, `created_at`, `updated_at`) VALUES
(1, 'NT-01', 'HH2', 'Chiếc', 1, 100, 100, 150, 150, '2023-12-17 22:21:07', '2023-12-17 22:21:07');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_thus`
--

CREATE TABLE `phieu_thus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `HoTen` varchar(255) NOT NULL,
  `DiaChi` varchar(255) NOT NULL,
  `SoChungTuGoc` double NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `BieuThue` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_thus`
--

INSERT INTO `phieu_thus` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `HoTen`, `DiaChi`, `SoChungTuGoc`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `DienGiai`, `BieuThue`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `ThueSuat`, `MatHang`, `created_at`, `updated_at`) VALUES
(1, 'PT-01', 'PT', '2023-12-18', '01', 'Demo', 'Demo', 123456789, 'KH01', 'Đỗ Ngọc Quang', '123456', 'Demo', '123456789', '123456789', '123456789', '2023-12-18', 10, 'Demo', '2023-12-17 21:29:08', '2023-12-17 21:29:08');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_thu_chi_tiets`
--

CREATE TABLE `phieu_thu_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `DienGiaiChiTiet` varchar(255) NOT NULL,
  `SoTien` double NOT NULL,
  `TaiKhoanNo` varchar(255) NOT NULL,
  `TaiKhoanCo` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_thu_chi_tiets`
--

INSERT INTO `phieu_thu_chi_tiets` (`id`, `MaChungTu`, `DienGiaiChiTiet`, `SoTien`, `TaiKhoanNo`, `TaiKhoanCo`, `created_at`, `updated_at`) VALUES
(1, 'PT-01', 'Demo', 100, '111', '131', '2023-12-17 21:29:08', '2023-12-17 21:29:08');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_xuat_hang_hoas`
--

CREATE TABLE `phieu_xuat_hang_hoas` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `TaiKhoanNoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanCoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanNoGiaBan` varchar(255) NOT NULL,
  `TaiKhoanCoGiaBan` varchar(255) NOT NULL,
  `TaiKhoanCoGTGT` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `ThueSuat` double NOT NULL,
  `ThueGTGT` double NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_xuat_hang_hoas`
--

INSERT INTO `phieu_xuat_hang_hoas` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `TaiKhoanNoGiaVon`, `TaiKhoanCoGiaVon`, `TaiKhoanNoGiaBan`, `TaiKhoanCoGiaBan`, `TaiKhoanCoGTGT`, `DienGiai`, `MatHang`, `ThueSuat`, `ThueGTGT`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `created_at`, `updated_at`) VALUES
(1, 'XH-01', 'XH', '2023-12-18', '01', 'KH01', 'Đỗ Ngọc Quang', '123456', '632', '156', '131', '511', '3331', 'Xuất 1 chiếc Laptop', 'Laptop', 10, 150, '123', '123', '2023-12-18', '2023-12-17 21:50:28', '2023-12-17 21:50:28');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_xuat_hang_hoa_chi_tiets`
--

CREATE TABLE `phieu_xuat_hang_hoa_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `MaHang` varchar(255) NOT NULL,
  `DonViTinh` varchar(255) NOT NULL,
  `SoLuong` double NOT NULL,
  `DonGiaVon` double NOT NULL,
  `ThanhTienGiaVon` double NOT NULL,
  `DonGiaBan` double NOT NULL,
  `ThanhTienGiaBan` double NOT NULL,
  `MaChungTuNhap` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_xuat_hang_hoa_chi_tiets`
--

INSERT INTO `phieu_xuat_hang_hoa_chi_tiets` (`id`, `MaChungTu`, `MaHang`, `DonViTinh`, `SoLuong`, `DonGiaVon`, `ThanhTienGiaVon`, `DonGiaBan`, `ThanhTienGiaBan`, `MaChungTuNhap`, `created_at`, `updated_at`) VALUES
(1, 'XH-01', 'HH2', 'Chiếc', 1, 100, 100, 1500, 1500, 'NH-02', '2023-12-17 21:50:28', '2023-12-17 21:50:28');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_xuat_hang_tra_lais`
--

CREATE TABLE `phieu_xuat_hang_tra_lais` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `LoaiChungTu` varchar(255) NOT NULL,
  `NgayChungTu` date NOT NULL,
  `SoChungTu` varchar(255) NOT NULL,
  `DienGiai` varchar(255) NOT NULL,
  `MaKhachHang` varchar(255) NOT NULL,
  `TenKhachHang` varchar(255) NOT NULL,
  `MaSoThue` varchar(255) NOT NULL,
  `TaiKhoanNoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanCoGiaVon` varchar(255) NOT NULL,
  `TaiKhoanNoGiaMua` varchar(255) NOT NULL,
  `TaiKhoanCoGTGT` varchar(255) NOT NULL,
  `TaiKhoanCoGiaMua` varchar(255) NOT NULL,
  `BieuThue` varchar(255) NOT NULL,
  `SoXeRy` varchar(255) NOT NULL,
  `SoHoaDon` varchar(255) NOT NULL,
  `NgayHoaDon` date NOT NULL,
  `ThueSuat` double NOT NULL,
  `ThueGTGT` double NOT NULL,
  `MatHang` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_xuat_hang_tra_lais`
--

INSERT INTO `phieu_xuat_hang_tra_lais` (`id`, `MaChungTu`, `LoaiChungTu`, `NgayChungTu`, `SoChungTu`, `DienGiai`, `MaKhachHang`, `TenKhachHang`, `MaSoThue`, `TaiKhoanNoGiaVon`, `TaiKhoanCoGiaVon`, `TaiKhoanNoGiaMua`, `TaiKhoanCoGTGT`, `TaiKhoanCoGiaMua`, `BieuThue`, `SoXeRy`, `SoHoaDon`, `NgayHoaDon`, `ThueSuat`, `ThueGTGT`, `MatHang`, `created_at`, `updated_at`) VALUES
(1, 'XT-01', 'XT', '2023-12-18', '01', 'Demo', 'KH01', 'Đỗ Ngọc Quang', '123456', '632', '156', '131', '3331', '511', '123', '123', '123', '2023-12-18', 10, 15, 'Demo', '2023-12-17 22:21:51', '2023-12-17 22:21:51');

-- --------------------------------------------------------

--
-- Table structure for table `phieu_xuat_hang_tra_lai_chi_tiets`
--

CREATE TABLE `phieu_xuat_hang_tra_lai_chi_tiets` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `MaChungTu` varchar(255) NOT NULL,
  `MaHang` varchar(255) NOT NULL,
  `DonViTinh` varchar(255) NOT NULL,
  `SoLuong` double NOT NULL,
  `DonGiaVon` double NOT NULL,
  `ThanhTienGiaVon` double NOT NULL,
  `DonGiaMua` double NOT NULL,
  `ThanhTienGiaMua` double NOT NULL,
  `MaChungTuNhap` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `phieu_xuat_hang_tra_lai_chi_tiets`
--

INSERT INTO `phieu_xuat_hang_tra_lai_chi_tiets` (`id`, `MaChungTu`, `MaHang`, `DonViTinh`, `SoLuong`, `DonGiaVon`, `ThanhTienGiaVon`, `DonGiaMua`, `ThanhTienGiaMua`, `MaChungTuNhap`, `created_at`, `updated_at`) VALUES
(1, 'XT-01', 'HH2', 'Chiếc', 1, 100, 100, 150, 150, 'NH-01', '2023-12-17 22:21:51', '2023-12-17 22:21:51');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_thong_tin_cong_tys`
--

CREATE TABLE `tbl_thong_tin_cong_tys` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ThongTin` varchar(255) NOT NULL,
  `ChuThich` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `sodienthoai` varchar(255) DEFAULT NULL,
  `diachi` varchar(255) DEFAULT NULL,
  `Them` tinyint(1) DEFAULT NULL,
  `Sua` tinyint(1) DEFAULT NULL,
  `Xoa` tinyint(1) DEFAULT NULL,
  `isAdmin` tinyint(1) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `avatar`, `sodienthoai`, `diachi`, `Them`, `Sua`, `Xoa`, `isAdmin`, `created_at`, `updated_at`) VALUES
(1, 'Đỗ Ngọc Quang', 'dongocquang@gmail.com', NULL, '$2y$10$M3DvVi8VcsaePhUI2y9O7uR6fMP2G2TFQKuxTM31USlkroygJAU5C', NULL, '2.jpg', NULL, NULL, NULL, NULL, NULL, NULL, '2023-12-17 21:23:39', '2023-12-17 21:23:48');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `chung_tu_ghi_sos`
--
ALTER TABLE `chung_tu_ghi_sos`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `chung_tu_ghi_sos_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `chung_tu_ghi_so_chi_tiets`
--
ALTER TABLE `chung_tu_ghi_so_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chung_tu_ghi_so_chi_tiets_machungtu_foreign` (`MaChungTu`);

--
-- Indexes for table `chung_tu_ket_chuyens`
--
ALTER TABLE `chung_tu_ket_chuyens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `chung_tu_ket_chuyens_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `chung_tu_ket_chuyen_chi_tiets`
--
ALTER TABLE `chung_tu_ket_chuyen_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chung_tu_ket_chuyen_chi_tiets_machungtu_foreign` (`MaChungTu`);

--
-- Indexes for table `chung_tu_ngan_hangs`
--
ALTER TABLE `chung_tu_ngan_hangs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `chung_tu_ngan_hangs_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `chung_tu_ngan_hang_chi_tiets`
--
ALTER TABLE `chung_tu_ngan_hang_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chung_tu_ngan_hang_chi_tiets_machungtu_foreign` (`MaChungTu`);

--
-- Indexes for table `danh_muc_chung_tus`
--
ALTER TABLE `danh_muc_chung_tus`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `danh_muc_chung_tus_maloaichungtu_unique` (`MaLoaiChungTu`);

--
-- Indexes for table `danh_muc_hang_hoas`
--
ALTER TABLE `danh_muc_hang_hoas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `danh_muc_hang_hoas_mahang_unique` (`MaHang`);

--
-- Indexes for table `danh_muc_khach_hangs`
--
ALTER TABLE `danh_muc_khach_hangs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `danh_muc_khach_hangs_makhachhang_unique` (`MaKhachHang`);

--
-- Indexes for table `danh_muc_tai_khoans`
--
ALTER TABLE `danh_muc_tai_khoans`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `danh_muc_tai_khoans_taikhoan_unique` (`TaiKhoan`);

--
-- Indexes for table `danh_muc_tai_khoan_cong_no_khach_hangs`
--
ALTER TABLE `danh_muc_tai_khoan_cong_no_khach_hangs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `danh_muc_tai_khoan_cong_no_khach_hangs_taikhoan_foreign` (`TaiKhoan`),
  ADD KEY `danh_muc_tai_khoan_cong_no_khach_hangs_makhachhang_foreign` (`MaKhachHang`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `phieu_chis`
--
ALTER TABLE `phieu_chis`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_chis_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_chi_chi_tiets`
--
ALTER TABLE `phieu_chi_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_chi_chi_tiets_machungtu_foreign` (`MaChungTu`);

--
-- Indexes for table `phieu_nhap_hang_hoas`
--
ALTER TABLE `phieu_nhap_hang_hoas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_nhap_hang_hoas_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_nhap_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_hoa_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_nhap_hang_hoa_chi_tiets_machungtu_foreign` (`MaChungTu`),
  ADD KEY `phieu_nhap_hang_hoa_chi_tiets_mahang_foreign` (`MaHang`);

--
-- Indexes for table `phieu_nhap_hang_tra_lais`
--
ALTER TABLE `phieu_nhap_hang_tra_lais`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_nhap_hang_tra_lais_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_nhap_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_tra_lai_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_nhap_hang_tra_lai_chi_tiets_machungtu_foreign` (`MaChungTu`),
  ADD KEY `phieu_nhap_hang_tra_lai_chi_tiets_mahang_foreign` (`MaHang`);

--
-- Indexes for table `phieu_thus`
--
ALTER TABLE `phieu_thus`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_thus_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_thu_chi_tiets`
--
ALTER TABLE `phieu_thu_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_thu_chi_tiets_machungtu_foreign` (`MaChungTu`);

--
-- Indexes for table `phieu_xuat_hang_hoas`
--
ALTER TABLE `phieu_xuat_hang_hoas`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_xuat_hang_hoas_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_xuat_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_hoa_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_xuat_hang_hoa_chi_tiets_machungtu_foreign` (`MaChungTu`),
  ADD KEY `phieu_xuat_hang_hoa_chi_tiets_mahang_foreign` (`MaHang`);

--
-- Indexes for table `phieu_xuat_hang_tra_lais`
--
ALTER TABLE `phieu_xuat_hang_tra_lais`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phieu_xuat_hang_tra_lais_machungtu_unique` (`MaChungTu`);

--
-- Indexes for table `phieu_xuat_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_tra_lai_chi_tiets`
  ADD PRIMARY KEY (`id`),
  ADD KEY `phieu_xuat_hang_tra_lai_chi_tiets_machungtu_foreign` (`MaChungTu`),
  ADD KEY `phieu_xuat_hang_tra_lai_chi_tiets_mahang_foreign` (`MaHang`);

--
-- Indexes for table `tbl_thong_tin_cong_tys`
--
ALTER TABLE `tbl_thong_tin_cong_tys`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `chung_tu_ghi_sos`
--
ALTER TABLE `chung_tu_ghi_sos`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chung_tu_ghi_so_chi_tiets`
--
ALTER TABLE `chung_tu_ghi_so_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chung_tu_ket_chuyens`
--
ALTER TABLE `chung_tu_ket_chuyens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chung_tu_ket_chuyen_chi_tiets`
--
ALTER TABLE `chung_tu_ket_chuyen_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `chung_tu_ngan_hangs`
--
ALTER TABLE `chung_tu_ngan_hangs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `chung_tu_ngan_hang_chi_tiets`
--
ALTER TABLE `chung_tu_ngan_hang_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `danh_muc_chung_tus`
--
ALTER TABLE `danh_muc_chung_tus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `danh_muc_hang_hoas`
--
ALTER TABLE `danh_muc_hang_hoas`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `danh_muc_khach_hangs`
--
ALTER TABLE `danh_muc_khach_hangs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `danh_muc_tai_khoans`
--
ALTER TABLE `danh_muc_tai_khoans`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=240;

--
-- AUTO_INCREMENT for table `danh_muc_tai_khoan_cong_no_khach_hangs`
--
ALTER TABLE `danh_muc_tai_khoan_cong_no_khach_hangs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `phieu_chis`
--
ALTER TABLE `phieu_chis`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_chi_chi_tiets`
--
ALTER TABLE `phieu_chi_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_nhap_hang_hoas`
--
ALTER TABLE `phieu_nhap_hang_hoas`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `phieu_nhap_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_hoa_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `phieu_nhap_hang_tra_lais`
--
ALTER TABLE `phieu_nhap_hang_tra_lais`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_nhap_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_tra_lai_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_thus`
--
ALTER TABLE `phieu_thus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_thu_chi_tiets`
--
ALTER TABLE `phieu_thu_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_xuat_hang_hoas`
--
ALTER TABLE `phieu_xuat_hang_hoas`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_xuat_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_hoa_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_xuat_hang_tra_lais`
--
ALTER TABLE `phieu_xuat_hang_tra_lais`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `phieu_xuat_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_tra_lai_chi_tiets`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tbl_thong_tin_cong_tys`
--
ALTER TABLE `tbl_thong_tin_cong_tys`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `chung_tu_ghi_so_chi_tiets`
--
ALTER TABLE `chung_tu_ghi_so_chi_tiets`
  ADD CONSTRAINT `chung_tu_ghi_so_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `chung_tu_ghi_sos` (`MaChungTu`);

--
-- Constraints for table `chung_tu_ket_chuyen_chi_tiets`
--
ALTER TABLE `chung_tu_ket_chuyen_chi_tiets`
  ADD CONSTRAINT `chung_tu_ket_chuyen_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `chung_tu_ket_chuyens` (`MaChungTu`);

--
-- Constraints for table `chung_tu_ngan_hang_chi_tiets`
--
ALTER TABLE `chung_tu_ngan_hang_chi_tiets`
  ADD CONSTRAINT `chung_tu_ngan_hang_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `chung_tu_ngan_hangs` (`MaChungTu`);

--
-- Constraints for table `danh_muc_tai_khoan_cong_no_khach_hangs`
--
ALTER TABLE `danh_muc_tai_khoan_cong_no_khach_hangs`
  ADD CONSTRAINT `danh_muc_tai_khoan_cong_no_khach_hangs_makhachhang_foreign` FOREIGN KEY (`MaKhachHang`) REFERENCES `danh_muc_khach_hangs` (`MaKhachHang`),
  ADD CONSTRAINT `danh_muc_tai_khoan_cong_no_khach_hangs_taikhoan_foreign` FOREIGN KEY (`TaiKhoan`) REFERENCES `danh_muc_tai_khoans` (`TaiKhoan`);

--
-- Constraints for table `phieu_chi_chi_tiets`
--
ALTER TABLE `phieu_chi_chi_tiets`
  ADD CONSTRAINT `phieu_chi_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_chis` (`MaChungTu`);

--
-- Constraints for table `phieu_nhap_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_hoa_chi_tiets`
  ADD CONSTRAINT `phieu_nhap_hang_hoa_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_nhap_hang_hoas` (`MaChungTu`),
  ADD CONSTRAINT `phieu_nhap_hang_hoa_chi_tiets_mahang_foreign` FOREIGN KEY (`MaHang`) REFERENCES `danh_muc_hang_hoas` (`MaHang`);

--
-- Constraints for table `phieu_nhap_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_nhap_hang_tra_lai_chi_tiets`
  ADD CONSTRAINT `phieu_nhap_hang_tra_lai_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_nhap_hang_tra_lais` (`MaChungTu`),
  ADD CONSTRAINT `phieu_nhap_hang_tra_lai_chi_tiets_mahang_foreign` FOREIGN KEY (`MaHang`) REFERENCES `danh_muc_hang_hoas` (`MaHang`);

--
-- Constraints for table `phieu_thu_chi_tiets`
--
ALTER TABLE `phieu_thu_chi_tiets`
  ADD CONSTRAINT `phieu_thu_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_thus` (`MaChungTu`);

--
-- Constraints for table `phieu_xuat_hang_hoa_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_hoa_chi_tiets`
  ADD CONSTRAINT `phieu_xuat_hang_hoa_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_xuat_hang_hoas` (`MaChungTu`),
  ADD CONSTRAINT `phieu_xuat_hang_hoa_chi_tiets_mahang_foreign` FOREIGN KEY (`MaHang`) REFERENCES `danh_muc_hang_hoas` (`MaHang`);

--
-- Constraints for table `phieu_xuat_hang_tra_lai_chi_tiets`
--
ALTER TABLE `phieu_xuat_hang_tra_lai_chi_tiets`
  ADD CONSTRAINT `phieu_xuat_hang_tra_lai_chi_tiets_machungtu_foreign` FOREIGN KEY (`MaChungTu`) REFERENCES `phieu_xuat_hang_tra_lais` (`MaChungTu`),
  ADD CONSTRAINT `phieu_xuat_hang_tra_lai_chi_tiets_mahang_foreign` FOREIGN KEY (`MaHang`) REFERENCES `danh_muc_hang_hoas` (`MaHang`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
